In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
names = lambda o: print([name for name in dir(o) if name[0] != "-"])

In [3]:
# 1
a = np.array([0, 3, 2])
b = np.array([4, 1, 3])
a + b

array([4, 4, 5])

In [4]:
# 2
pd.Series(a)

0    0
1    3
2    2
dtype: int64

In [5]:
# 3
pd.DataFrame(a)

   0
0  0
1  3
2  2

In [6]:
# 4
# list("ABC") == ["A", "B", "C"]
pd.Series(a, index = list("ABC"))

A    0
B    3
C    2
dtype: int64

In [7]:
# 5
df = pd.DataFrame(np.random.randint(0, 10, size = (5, 5)), 
             index = ["ene", "feb", "mar", "abr", "may"],
            columns = list("ABCDE"))
df

     A  B  C  D  E
ene  6  6  7  8  3
feb  3  9  3  5  4
mar  1  7  3  7  5
abr  6  2  1  7  0
may  6  3  5  1  2

In [8]:
# 6
s = pd.Series(
        data = np.random.randint(0, 10, size = 6), 
        index = list("ABCDEF")
        )
s

A    9
B    9
C    1
D    1
E    8
F    9
dtype: int64

In [9]:
# 7
s["B"]

9

In [10]:
# 8
s[1]

9

In [11]:
# 9
r = pd.Series(
    data = [10, 11, 12], 
    index = [2, 1, 0])
r

2    10
1    11
0    12
dtype: int64

In [12]:
r[0]

12

In [13]:
# Etiquetas
r.loc[0]

12

In [14]:
# Pisiciones
r.iloc[0]

10

In [15]:
t = pd.Series([2, 4, 6])
t

0    2
1    4
2    6
dtype: int64

In [16]:
t.loc[1]

4

In [17]:
t.iloc[1]

4

In [18]:
s["B":"E"]

B    9
C    1
D    1
E    8
dtype: int64

In [19]:
s[["E","B"]]

E    8
B    9
dtype: int64

In [20]:
df

     A  B  C  D  E
ene  6  6  7  8  3
feb  3  9  3  5  4
mar  1  7  3  7  5
abr  6  2  1  7  0
may  6  3  5  1  2

In [21]:
df["B"]

ene    6
feb    9
mar    7
abr    2
may    3
Name: B, dtype: int64

In [22]:
df.B

ene    6
feb    9
mar    7
abr    2
may    3
Name: B, dtype: int64

In [23]:
names(df)

['A', 'B', 'C', 'D', 'E', 'T', '_AXIS_LEN', '_AXIS_ORDERS', '_AXIS_REVERSED', '_AXIS_TO_AXIS_NUMBER', '_HANDLED_TYPES', '__abs__', '__add__', '__and__', '__annotations__', '__array__', '__array_priority__', '__array_ufunc__', '__array_wrap__', '__bool__', '__class__', '__contains__', '__copy__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__divmod__', '__doc__', '__eq__', '__finalize__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__iand__', '__ifloordiv__', '__imod__', '__imul__', '__init__', '__init_subclass__', '__invert__', '__ior__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__ixor__', '__le__', '__len__', '__lt__', '__matmul__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdivmod__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmatmul__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__weakref__', '__xor__', '_accessors', '_accum_func', '_add_numeric_operations', '_agg_by_level', '_agg_examples_doc', '_agg_summary_and_see_also_doc', '_aggregate', '_align_frame', '_align_series', '_arith_method', '_attrs', '_box_col_values', '_builtin_table', '_can_fast_transpose', '_check_inplace_and_allows_duplicate_labels', '_check_inplace_setting', '_check_is_chained_assignment_possible', '_check_label_or_level_ambiguity', '_check_setitem_copy', '_clear_item_cache', '_clip_with_one_bound', '_clip_with_scalar', '_cmp_method', '_combine_frame', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_axes_from_arguments', '_construct_result', '_constructor', '_constructor_expanddim', '_constructor_sliced', '_convert', '_count_level', '_cython_table', '_data', '_dir_additions', '_dir_deletions', '_dispatch_frame_op', '_drop_axis', '_drop_labels_or_levels', '_ensure_valid_index', '_find_valid_index', '_flags', '_from_arrays', '_get_agg_axis', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cacher', '_get_cleaned_column_resolvers', '_get_column_array', '_get_cython_func', '_get_index_resolvers', '_get_item_cache', '_get_label_or_level_values', '_get_numeric_data', '_get_value', '_getitem_bool_array', '_getitem_multilevel', '_gotitem', '_hidden_attrs', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_info_repr', '_init_mgr', '_inplace_method', '_internal_names', '_internal_names_set', '_is_builtin_func', '_is_cached', '_is_copy', '_is_homogeneous_type', '_is_label_or_level_reference', '_is_label_reference', '_is_level_reference', '_is_mixed_type', '_is_view', '_iset_item', '_item_cache', '_iter_column_arrays', '_ix', '_ixs', '_join_compat', '_logical_func', '_logical_method', '_maybe_cache_changed', '_maybe_update_cacher', '_metadata', '_mgr', '_min_count_stat_function', '_needs_reindex_multi', '_obj_with_exclusions', '_protect_consolidate', '_reduce', '_reindex_axes', '_reindex_columns', '_reindex_index', '_reindex_multi', '_reindex_with_indexers', '_replace_columnwise', '_repr_data_resource_', '_repr_fits_horizontal_', '_repr_fits_vertical_', '_repr_html_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_sanitize_column', '_selected_obj', '_selection', '_selection_list', '_selection_name', '_series', '_set_as_cached', '_set_axis', '_set_axis_name', '_set_axis_nocheck', '_set_is_copy', '_set_item', '_set_value', '_setitem_array', '_setitem_frame', '_setitem_slice', '_slice', '_stat_axis', '_stat_axis_name', '_stat_axis_number', '_stat_function', '_stat_function_ddof', '_take_with_is_copy', '_to_dict_of_blocks', '_try_aggregate_string_function', '_typ', '_update_inplace', '_validate_dtype', '_values', '_where', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'append', 'apply', 'applymap', 'asfreq', 'asof', 'assign', 'astype', 'at', 'at_time', 'attrs', 'axes', 'backfill', 'between_time', 'bfill', 'bool', 'boxplot', 'clip', 'columns', 'combine', 'combine_first', 'compare', 'convert_dtypes', 'copy', 'corr', 'corrwith', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'div', 'divide', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'eval', 'ewm', 'expanding', 'explode', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'flags', 'floordiv', 'from_dict', 'from_records', 'ge', 'get', 'groupby', 'gt', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'info', 'insert', 'interpolate', 'isin', 'isna', 'isnull', 'items', 'iteritems', 'iterrows', 'itertuples', 'join', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'loc', 'lookup', 'lt', 'mad', 'mask', 'max', 'mean', 'median', 'melt', 'memory_usage', 'merge', 'min', 'mod', 'mode', 'mul', 'multiply', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pad', 'pct_change', 'pipe', 'pivot', 'pivot_table', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'query', 'radd', 'rank', 'rdiv', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'select_dtypes', 'sem', 'set_axis', 'set_flags', 'set_index', 'shape', 'shift', 'size', 'skew', 'slice_shift', 'sort_index', 'sort_values', 'squeeze', 'stack', 'std', 'style', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_feather', 'to_gbq', 'to_hdf', 'to_html', 'to_json', 'to_latex', 'to_markdown', 'to_numpy', 'to_parquet', 'to_period', 'to_pickle', 'to_records', 'to_sql', 'to_stata', 'to_string', 'to_timestamp', 'to_xarray', 'transform', 'transpose', 'truediv', 'truncate', 'tz_convert', 'tz_localize', 'unstack', 'update', 'value_counts', 'values', 'var', 'where', 'xs']

In [24]:
df.shape

(5, 5)

In [25]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'taxis',
 'tips',
 'titanic']

In [26]:
tips = sns.load_dataset("tips")

In [27]:
# Para visualizar un DataFrame
'''
df.head()        cabecera
df.head(2)
df.tail()
df.tail(3) -     3 ultimas lineas
df.sample()  -   lineas aleatorias
df.sample(5)  -  5 lineas aleatorias
'''

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [28]:
tips.sample(10)

     total_bill   tip     sex smoker  day    time  size
159       16.49  2.00    Male     No  Sun  Dinner     4
11        35.26  5.00  Female     No  Sun  Dinner     4
49        18.04  3.00    Male     No  Sun  Dinner     2
166       20.76  2.24    Male     No  Sun  Dinner     2
7         26.88  3.12    Male     No  Sun  Dinner     4
175       32.90  3.11    Male    Yes  Sun  Dinner     2
53         9.94  1.56    Male     No  Sun  Dinner     2
107       25.21  4.29    Male    Yes  Sat  Dinner     2
185       20.69  5.00    Male     No  Sun  Dinner     5
5         25.29  4.71    Male     No  Sun  Dinner     4

In [29]:
t = tips.head()
t

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [30]:
help(id)

Help on built-in function id in module builtins:

id(obj, /)
    Return the identity of an object.

    This is guaranteed to be unique among simultaneously existing objects.
    (CPython uses the object's memory address.)

In [32]:
id(df)

140561572203488

In [33]:
id(tips)

140561265287856

In [34]:
id(t)

140561277418656

In [35]:
tips.shape

(244, 7)

In [36]:
t.shape

(5, 7)

In [37]:
# Numero de elementos de un DataFrame
t.size

35

In [38]:
t["size"]

0    2
1    3
2    3
3    2
4    4
Name: size, dtype: int64

In [39]:
type(t.tip)

pandas.core.series.Series

In [40]:
t.tip.values

array([1.01, 1.66, 3.5 , 3.31, 3.61])

In [41]:
t.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [42]:
t.time.values

['Dinner', 'Dinner', 'Dinner', 'Dinner', 'Dinner']
Categories (2, object): ['Lunch', 'Dinner']

In [43]:
t.sex.dtype

CategoricalDtype(categories=['Male', 'Female'], ordered=False)

In [46]:
t.sex.astype("str").dtype

dtype('O')

In [47]:
# extraciones
t

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [48]:
t[2:4]

   total_bill   tip   sex smoker  day    time  size
2       21.01  3.50  Male     No  Sun  Dinner     3
3       23.68  3.31  Male     No  Sun  Dinner     2

In [50]:
t[["tip", "day"]]

    tip  day
0  1.01  Sun
1  1.66  Sun
2  3.50  Sun
3  3.31  Sun
4  3.61  Sun

In [51]:
t

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [52]:
# utilisar etiquetas explicitas
t.loc[2, "sex"]

'Male'

In [53]:
t.iloc[2, 2]

'Male'

In [54]:
t.loc[2]
# lo mismo que poner t.loc[2, :]

total_bill     21.01
tip              3.5
sex             Male
smoker            No
day              Sun
time          Dinner
size               3
Name: 2, dtype: object

In [55]:
t

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [56]:
t.loc[[3, 1]]

   total_bill   tip   sex smoker  day    time  size
3       23.68  3.31  Male     No  Sun  Dinner     2
1       10.34  1.66  Male     No  Sun  Dinner     3

In [58]:
t.loc[[3, 1], "day"]

3    Sun
1    Sun
Name: day, dtype: category
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [59]:
a = pd.Series(data = np.random.randint(0, 10, size = 4))
a

0    6
1    3
2    9
3    8
dtype: int64

In [60]:
a[[True, False, False, True]]

0    6
3    8
dtype: int64

In [62]:
a = pd.Series(data = np.random.randint(0, 10, size = 10))
a

0    4
1    5
2    2
3    2
4    2
5    9
6    8
7    2
8    8
9    9
dtype: int64

In [63]:
a > 5

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7    False
8     True
9     True
dtype: bool

In [64]:
a[a > 5]

5    9
6    8
8    8
9    9
dtype: int64

In [65]:
# recomendacion de usar ese
a.loc[a > 5]

5    9
6    8
8    8
9    9
dtype: int64

In [66]:
a.iloc[a > 5]

NotImplementedError: iLocation based boolean indexing on an integer type is not available

In [67]:
a.iloc[(a > 5).values]

5    9
6    8
8    8
9    9
dtype: int64

In [68]:
t.loc[t.tip > 2]

   total_bill   tip     sex smoker  day    time  size
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [69]:
t.tip > 2

0    False
1    False
2     True
3     True
4     True
Name: tip, dtype: bool